{
  "bos_token": "<s>",
  "cls_token": "<s>",
  "do_lower_case": false,
  "eos_token": "</s>",
  "full_tokenizer_file": null,
  "mask_token": {
    "__type": "AddedToken",
    "content": "<mask>",
    "lstrip": true,
    "normalized": true,
    "rstrip": false,
    "single_word": false
  },
  "model_max_length": 512,
  "name_or_path": "/mnt/data/factcheck/nli_models/lrev_aug22/paper/ctkfacts_nli/deepset/xlm-roberta-large-squad2_bs10_ep100_wr0.3",
  "pad_token": "<pad>",
  "sep_token": "</s>",
  "sp_model_kwargs": {},
  "special_tokens_map_file": "germanQA/saved_models/xlm-roberta-large-squad2/special_tokens_map.json",
  "tokenizer_class": "XLMRobertaTokenizer",
  "unk_token": "<unk>"
}
